Documents/ОтчетПоНалогуНаИмущество.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Document>
		<Properties>
			<Name>ОтчетПоНалогуНаИмущество</Name>
			<Posting>Deny</Posting>
			<RegisterRecords>
				<xr:Item>AccountingRegister.Хозрасчетный</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ИнвентаризацияТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Недвижимость</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаИмущества</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОценочнаяСтоимость</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СрокЭксплуатации</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбщаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кр</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Кз</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ко</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтоимостьНУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МатериалСтен</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыМатериаловСтен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗемНалог</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЖилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НежилаяПлощадь</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Объект</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОбъектыЗданийИСооружений</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Транспорт</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ОсновноеСредство</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ОсновныеСредства</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ГруппаИмущества</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ГруппыИмущества</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АБВ</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоличествоМесяцев</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъемДвигателя</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидТранспорта</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыТранспортаПоНалогуНаИмущество</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Ставка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаНалога</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОтЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДоЛет</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>3</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ОтчетПоНалогуНаИмущество/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Функция -ПолучитьКонтактнуюИнформацию
//
// Параметры:
//  Организация  - Спр.Ссылка - Спр.Органинизации 
// Возвращаемое значение:
//  Структура   - структура данных контактной информации
//
Функция ПолучитьКонтактнуюИнформацию(Организация)
	
	СведенияОбОрганизации = БухгалтерскийУчетСервер.ПолучитьСведенияОбОрганизации(Организация);

	Индекс = СведенияОбОрганизации.Индекс; 
	
	ГородНасПункт   = ?(СведенияОбОрганизации.Город  = "",СведенияОбОрганизации.НаселенныйПункт,СведенияОбОрганизации.Город);
	АдрОбластьГород = ?(СведенияОбОрганизации.Регион = "","",СведенияОбОрганизации.Регион + ",")
		+ ?(СведенияОбОрганизации.Район  = "","", " " + СведенияОбОрганизации.Район + ",") 
		+ ?(ГородНасПункт = "",""," " + ГородНасПункт); 
	АдресОрганизации = ?(СведенияОбОрганизации.Улица    = "","",СведенияОбОрганизации.Улица + ",")
		+ ?(СведенияОбОрганизации.Дом      = "",""," " + СведенияОбОрганизации.Дом + ",")
		+ ?(СведенияОбОрганизации.Корпус   = "",""," " + СведенияОбОрганизации.Корпус + ",")
		+ ?(СведенияОбОрганизации.Квартира = "",""," " + СведенияОбОрганизации.Квартира);
		
	Телефон = СведенияОбОрганизации.Тел;
	
	Структура = Новый Структура("Индекс,АдрОбластьГород,АдресОрганизации,Телефон", Индекс,АдрОбластьГород,АдресОрганизации,Телефон);
	
	Возврат Структура;
	
КонецФункции // ПолучитьАдресОрганизации()

Процедура ВывестиЗаголовок(ТабличныйДокумент, Макет, Шапка)
	
	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	
	ОтчетныйГод = СтрЗаменить(Год(Шапка.Дата), Символы.НПП, "");
	ОбластьЗаголовок.Параметры.Год1 = Сред(ОтчетныйГод,1,1);
	ОбластьЗаголовок.Параметры.Год2 = Сред(ОтчетныйГод,2,1);
	ОбластьЗаголовок.Параметры.Год3 = Сред(ОтчетныйГод,3,1);
	ОбластьЗаголовок.Параметры.Год4 = Сред(ОтчетныйГод,4,1);
	
	КонтактныеДанные = ПолучитьКонтактнуюИнформацию(Шапка.Организация);
	Индекс           = КонтактныеДанные.Индекс;
	АдрОбластьГород  = КонтактныеДанные.АдрОбластьГород;
	ЮрАдрес	         = КонтактныеДанные.АдресОрганизации; 
	Телефон		     = КонтактныеДанные.Телефон;
	
	//ИНН Организации
	ИННОрг = Шапка.ОрганизацияИНН;
	ОбластьЗаголовок.Параметры.ИНН1					= Сред(ИННОрг,1,1);
	ОбластьЗаголовок.Параметры.ИНН2					= Сред(ИННОрг,2,1);
	ОбластьЗаголовок.Параметры.ИНН3					= Сред(ИННОрг,3,1);
	ОбластьЗаголовок.Параметры.ИНН4					= Сред(ИННОрг,4,1);
	ОбластьЗаголовок.Параметры.ИНН5					= Сред(ИННОрг,5,1);
	ОбластьЗаголовок.Параметры.ИНН6					= Сред(ИННОрг,6,1);
	ОбластьЗаголовок.Параметры.ИНН7					= Сред(ИННОрг,7,1);
	ОбластьЗаголовок.Параметры.ИНН8					= Сред(ИННОрг,8,1);
	ОбластьЗаголовок.Параметры.ИНН9					= Сред(ИННОрг,9,1);
	ОбластьЗаголовок.Параметры.ИНН10				= Сред(ИННОрг,10,1);
	ОбластьЗаголовок.Параметры.ИНН11				= Сред(ИННОрг,11,1);
	ОбластьЗаголовок.Параметры.ИНН12				= Сред(ИННОрг,12,1);
	ОбластьЗаголовок.Параметры.ИНН13				= Сред(ИННОрг,13,1);
	ОбластьЗаголовок.Параметры.ИНН14				= Сред(ИННОрг,14,1);
	//Наименование организации
	ОбластьЗаголовок.Параметры.НаименованиеОрганизации	= Шапка.ОрганизацияНаименованиеПолное;
	//Адрес
	ОбластьЗаголовок.Параметры.Область             = АдрОбластьГород;
	ОбластьЗаголовок.Параметры.УлицаДом            = ЮрАдрес;
	//Почтовый индекс
	ОбластьЗаголовок.Параметры.ИН1                 = Сред(Индекс,1,1);
	ОбластьЗаголовок.Параметры.ИН2                 = Сред(Индекс,2,1);
	ОбластьЗаголовок.Параметры.ИН3                 = Сред(Индекс,3,1);
	ОбластьЗаголовок.Параметры.ИН4                 = Сред(Индекс,4,1);
	ОбластьЗаголовок.Параметры.ИН5                 = Сред(Индекс,5,1);
	ОбластьЗаголовок.Параметры.ИН6                 = Сред(Индекс,6,1);
	//№ Телефона
	ОбластьЗаголовок.Параметры.Тел                 = Телефон;
	//Код НО
	Код = Шапка.ОрганизацияГНСКод;
	ОбластьЗаголовок.Параметры.Код1                = Сред(Код,1,1);
	ОбластьЗаголовок.Параметры.Код2                = Сред(Код,2,1);
	ОбластьЗаголовок.Параметры.Код3                = Сред(Код,3,1);
	
	//Код ОКПО
	КодОКПО = Шапка.ОрганизацияКодПоОКПО;
	ОбластьЗаголовок.Параметры.ОКПО1				= Сред(КодОКПО,1,1);
	ОбластьЗаголовок.Параметры.ОКПО2				= Сред(КодОКПО,2,1);
	ОбластьЗаголовок.Параметры.ОКПО3				= Сред(КодОКПО,3,1);
	ОбластьЗаголовок.Параметры.ОКПО4				= Сред(КодОКПО,4,1);
	ОбластьЗаголовок.Параметры.ОКПО5				= Сред(КодОКПО,5,1);
	ОбластьЗаголовок.Параметры.ОКПО6				= Сред(КодОКПО,6,1);
	ОбластьЗаголовок.Параметры.ОКПО7				= Сред(КодОКПО,7,1);
	ОбластьЗаголовок.Параметры.ОКПО8				= Сред(КодОКПО,8,1);	
	
	//Наименование налогового органа
	ОбластьЗаголовок.Параметры.НаименованиеРайонаРегистрации	= Шапка.ОрганизацияГНСНаименование;
	
	ШапкаТаблицы 	= Макет.ПолучитьОбласть("ШапкаТаблицы");
	ТабличныйДокумент.Вывести(ОбластьЗаголовок);	
	ТабличныйДокумент.Вывести(ШапкаТаблицы); 
		
КонецПроцедуры

#КонецОбласти
	
#Область ВерсионированиеОбъектов

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

#КонецОбласти

#Область ИнтерфейсПечати

// Функция формирует табличный документ с печатной формой НалогаНаИмущество2Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмущество2Группы(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Группа2";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмуществоНедвижимость.НомерСтроки,
		|	ОтчетНалогНаИмуществоНедвижимость.ОсновноеСредство,
		|	ОтчетНалогНаИмуществоНедвижимость.ГруппаИмущества,
		|	ОтчетНалогНаИмуществоНедвижимость.КоличествоМесяцев,
		|	ОтчетНалогНаИмуществоНедвижимость.Ставка,
		|	ОтчетНалогНаИмуществоНедвижимость.СуммаНалога КАК СуммаНалога,
		|	ОтчетНалогНаИмуществоНедвижимость.ОценочнаяСтоимость,
		|	ОтчетНалогНаИмуществоНедвижимость.СрокЭксплуатации,
		|	ОтчетНалогНаИмуществоНедвижимость.ОбщаяПлощадь,
		|	ОтчетНалогНаИмуществоНедвижимость.Кр,
		|	ОтчетНалогНаИмуществоНедвижимость.Кз,
		|	ОтчетНалогНаИмуществоНедвижимость.Ко,
		|	ОтчетНалогНаИмуществоНедвижимость.СтоимостьНУ,
		|	ОтчетНалогНаИмуществоНедвижимость.МатериалСтен,
		|	ОтчетНалогНаИмуществоНедвижимость.ЗемНалог КАК ЗемНалог,
		|	ОтчетНалогНаИмуществоНедвижимость.ОтЛет,
		|	ОтчетНалогНаИмуществоНедвижимость.ДоЛет,
		|	ОтчетНалогНаИмуществоНедвижимость.ЖилаяПлощадь,
		|	ОтчетНалогНаИмуществоНедвижимость.НежилаяПлощадь,
		|	ОтчетНалогНаИмуществоНедвижимость.Объект,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Дата КАК Дата,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.ИНН КАК ОрганизацияИНН,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.ГНС.Код КАК ОрганизацияГНСКод,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.КодПоОКПО КАК ОрганизацияКодПоОКПО,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.ГНС.Наименование КАК ОрганизацияГНСНаименование,
		|	ОтчетНалогНаИмуществоНедвижимость.ОсновноеСредство.ИдентификационныйНомерИмущества КАК ИдентификационныйКодИмущества
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество.Недвижимость КАК ОтчетНалогНаИмуществоНедвижимость
		|ГДЕ
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Ссылка В(&МассивОбъектов)
		|	И ОтчетНалогНаИмуществоНедвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|ИТОГИ
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(ОрганизацияНаименованиеПолное),
		|	МАКСИМУМ(ОрганизацияИНН),
		|	МАКСИМУМ(ОрганизацияГНСКод),
		|	МАКСИМУМ(ОрганизацияКодПоОКПО),
		|	МАКСИМУМ(ОрганизацияГНСНаименование)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Шапка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Макет = Документы.ОтчетПоНалогуНаИмущество.ПолучитьМакет("ПФ_MXL_Группа2");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ШапкаТаблицы 		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	Подвал				= Макет.ПолучитьОбласть("Подвал");
	ОбластьИтоги 		= Макет.ПолучитьОбласть("ОбластьИтоги");
	ОбластьСтрока		= Макет.ПолучитьОбласть("ОбластьДанных");	
	
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВыборкаДетальныеЗаписи = Шапка.Выбрать();
		НомерТекущейСтроки = 0;
		КоличествоОстатокСтрок = ВыборкаДетальныеЗаписи.Количество();
		ИтогоСуммаНалога 			= 0;
		ИтогоСуммаЗемельногоНалога 	= 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НомерТекущейСтроки = 0 Тогда
				ВывестиЗаголовок(ТабличныйДокумент, Макет, Шапка);
			КонецЕсли;
			НомерСтроки = 0;
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			КоличествоОстатокСтрок = КоличествоОстатокСтрок - 1;
			
			ОбластьСтрока	= Макет.ПолучитьОбласть("ОбластьДанных");
			Для НомерКолонки = 0 ПО 15 Цикл 
				Выполнить("ОбластьСтрока.Параметры.ЕАЭС" + НомерКолонки + " = " + Строка(300 + НомерКолонки + НомерСтроки));	
			КонецЦикла;				
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабличныйДокумент.Вывести(ОбластьСтрока);		
			НомерСтроки = НомерСтроки + 16;			
			
			Если КоличествоОстатокСтрок = 0 И НомерТекущейСтроки < 9 Тогда			
				Для Счетчик = НомерТекущейСтроки + 1 по 9 Цикл
					ОбластьСтрока	= Макет.ПолучитьОбласть("ОбластьДанных");
					Для НомерКолонки = 0 ПО 15 Цикл 
						Выполнить("ОбластьСтрока.Параметры.ЕАЭС" + НомерКолонки + " = " + Строка(300 + НомерКолонки + НомерСтроки));	
					КонецЦикла;					
					НомерСтроки = НомерСтроки + 16;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЦикла;
				НомерТекущейСтроки = 9;
			КонецЕсли;			
			ИтогоСуммаНалога 			= ИтогоСуммаНалога + ВыборкаДетальныеЗаписи.СуммаНалога;
			ИтогоСуммаЗемельногоНалога  = ИтогоСуммаЗемельногоНалога + ВыборкаДетальныеЗаписи.ЗемНалог;			
			Если НомерТекущейСтроки = 9 Тогда
				ОбластьИтоги.Параметры.ИтогоСуммаНалога = ИтогоСуммаНалога;
				ОбластьИтоги.Параметры.ИтогоСуммаЗемельногоНалога = ИтогоСуммаЗемельногоНалога;
				ОбластьИтоги.Параметры.СуммаНалогаКУплате = ИтогоСуммаНалога + ИтогоСуммаЗемельногоНалога;
			    ТабличныйДокумент.Вывести(ОбластьИтоги);
				ТабличныйДокумент.Вывести(Подвал);
				НомерТекущейСтроки = 0;
				ИтогоСуммаНалога           = 0;
				ИтогоСуммаЗемельногоНалога = 0;				
			КонецЕсли;
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НалогаНаИмущество3Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмущество3Группы(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;	
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Группа3";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмуществоНедвижимость.НомерСтроки,
		|	ОтчетНалогНаИмуществоНедвижимость.ОсновноеСредство,
		|	ОтчетНалогНаИмуществоНедвижимость.ГруппаИмущества,
		|	ОтчетНалогНаИмуществоНедвижимость.КоличествоМесяцев,
		|	ОтчетНалогНаИмуществоНедвижимость.Ставка,
		|	ОтчетНалогНаИмуществоНедвижимость.СуммаНалога КАК СуммаНалога,
		|	ОтчетНалогНаИмуществоНедвижимость.ОценочнаяСтоимость,
		|	ОтчетНалогНаИмуществоНедвижимость.СрокЭксплуатации,
		|	ОтчетНалогНаИмуществоНедвижимость.ОбщаяПлощадь,
		|	ОтчетНалогНаИмуществоНедвижимость.Кр,
		|	ОтчетНалогНаИмуществоНедвижимость.Кз,
		|	ОтчетНалогНаИмуществоНедвижимость.Ко,
		|	ОтчетНалогНаИмуществоНедвижимость.СтоимостьНУ,
		|	ОтчетНалогНаИмуществоНедвижимость.МатериалСтен,
		|	ОтчетНалогНаИмуществоНедвижимость.ЗемНалог КАК ЗемНалог,
		|	ОтчетНалогНаИмуществоНедвижимость.ОтЛет,
		|	ОтчетНалогНаИмуществоНедвижимость.ДоЛет,
		|	ОтчетНалогНаИмуществоНедвижимость.ЖилаяПлощадь,
		|	ОтчетНалогНаИмуществоНедвижимость.НежилаяПлощадь,
		|	ОтчетНалогНаИмуществоНедвижимость.Объект,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Дата КАК Дата,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.ИНН КАК ОрганизацияИНН,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.ГНС.Код КАК ОрганизацияГНСКод,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.КодПоОКПО КАК ОрганизацияКодПоОКПО,
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Организация.ГНС.Наименование КАК ОрганизацияГНСНаименование
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество.Недвижимость КАК ОтчетНалогНаИмуществоНедвижимость
		|ГДЕ
		|	ОтчетНалогНаИмуществоНедвижимость.Ссылка.Ссылка В(&МассивОбъектов)
		|	И ОтчетНалогНаИмуществоНедвижимость.ГруппаИмущества = ЗНАЧЕНИЕ(Справочник.ГруппыИмущества.ГИ2)
		|ИТОГИ
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(ОрганизацияНаименованиеПолное),
		|	МАКСИМУМ(ОрганизацияИНН),
		|	МАКСИМУМ(ОрганизацияГНСКод),
		|	МАКСИМУМ(ОрганизацияКодПоОКПО),
		|	МАКСИМУМ(ОрганизацияГНСНаименование)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Шапка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Макет = Документы.ОтчетПоНалогуНаИмущество.ПолучитьМакет("ПФ_MXL_Группа3");
	ОбластьЗаголовок 	= Макет.ПолучитьОбласть("Заголовок");
	ШапкаТаблицы 		= Макет.ПолучитьОбласть("ШапкаТаблицы");
	Подвал				= Макет.ПолучитьОбласть("Подвал");
	ОбластьИтоги 		= Макет.ПолучитьОбласть("ОбластьИтоги");
	ОбластьСтрока		= Макет.ПолучитьОбласть("ОбластьДанных");	
	
	Пока Шапка.Следующий() Цикл
		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВыборкаДетальныеЗаписи = Шапка.Выбрать();
		НомерТекущейСтроки = 0;
		КоличествоОстатокСтрок = ВыборкаДетальныеЗаписи.Количество();
		ИтогоСуммаНалога 			= 0;
		ИтогоСуммаЗемельногоНалога 	= 0;
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если НомерТекущейСтроки = 0 Тогда
				ВывестиЗаголовок(ТабличныйДокумент, Макет, Шапка);
			КонецЕсли;
			НомерСтроки = 0;
			НомерТекущейСтроки = НомерТекущейСтроки + 1;
			КоличествоОстатокСтрок = КоличествоОстатокСтрок - 1;
			
			ОбластьСтрока	= Макет.ПолучитьОбласть("ОбластьДанных");
			Для НомерКолонки = 0 ПО 14 Цикл 
				Выполнить("ОбластьСтрока.Параметры.ЕАЭС" + НомерКолонки + " = " + Строка(300 + НомерКолонки + НомерСтроки));	
			КонецЦикла;				
			ОбластьСтрока.Параметры.Заполнить(ВыборкаДетальныеЗаписи);
			ТабличныйДокумент.Вывести(ОбластьСтрока);		
			НомерСтроки = НомерСтроки + 15;			
			
			Если КоличествоОстатокСтрок = 0 И НомерТекущейСтроки < 9 Тогда			
				Для Счетчик = НомерТекущейСтроки + 1 по 9 Цикл
					ОбластьСтрока	= Макет.ПолучитьОбласть("ОбластьДанных");
					Для НомерКолонки = 0 ПО 14 Цикл 
						Выполнить("ОбластьСтрока.Параметры.ЕАЭС" + НомерКолонки + " = " + Строка(300 + НомерКолонки + НомерСтроки));	
					КонецЦикла;					
					НомерСтроки = НомерСтроки + 15;
					ТабличныйДокумент.Вывести(ОбластьСтрока);
				КонецЦикла;
				НомерТекущейСтроки = 9;
			КонецЕсли;			
			ИтогоСуммаНалога 			= ИтогоСуммаНалога + ВыборкаДетальныеЗаписи.СуммаНалога;
			ИтогоСуммаЗемельногоНалога  = ИтогоСуммаЗемельногоНалога + ВыборкаДетальныеЗаписи.ЗемНалог;			
			Если НомерТекущейСтроки = 9 Тогда
				ОбластьИтоги.Параметры.ИтогоСуммаНалога = ИтогоСуммаНалога;
				ОбластьИтоги.Параметры.ИтогоСуммаЗемельногоНалога = ИтогоСуммаЗемельногоНалога;
				ОбластьИтоги.Параметры.СуммаНалогаКУплате = ИтогоСуммаНалога + ИтогоСуммаЗемельногоНалога;
			    ТабличныйДокумент.Вывести(ОбластьИтоги);
				ТабличныйДокумент.Вывести(Подвал);
				НомерТекущейСтроки = 0;
				ИтогоСуммаНалога           = 0;
				ИтогоСуммаЗемельногоНалога = 0;				
			КонецЕсли;
			
		КонецЦикла;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Функция формирует табличный документ с печатной формой НалогаНаИмущество4Группы
//
// Возвращаемое значение:
//  Табличный документ - печатная форма
//
Функция ОтчетПоНалогуНаИмущество4Группы(МассивОбъектов, ОбъектыПечати)
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ПолеСлева = 0;
	ТабличныйДокумент.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
	ТабличныйДокумент.КлючПараметровПечати = "ОтчетПоНалогуНаИмущество_Группа4";
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка КАК Ссылка,
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Дата КАК Дата,
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Организация,
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Организация.НаименованиеПолное КАК ОрганизацияНаименованиеПолное,
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Организация.ИНН КАК ОрганизацияИНН,
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Организация.ГНС.Код КАК ОрганизацияГНСКод,
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Организация.ГНС.Наименование КАК ОрганизацияГНСНаименование,
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Организация.КодПоОКПО КАК ОрганизацияКодПоОКПО,
		|	ОтчетНалогНаИмуществоТранспорт.ОсновноеСредство,
		|	ОтчетНалогНаИмуществоТранспорт.ГруппаИмущества,
		|	ОтчетНалогНаИмуществоТранспорт.КоличествоМесяцев,
		|	ОтчетНалогНаИмуществоТранспорт.Ставка,
		|	ОтчетНалогНаИмуществоТранспорт.СуммаНалога КАК СуммаНалога,
		|	ОтчетНалогНаИмуществоТранспорт.АБВ,
		|	ОтчетНалогНаИмуществоТранспорт.ОбъемДвигателя,
		|	ОтчетНалогНаИмуществоТранспорт.ВидТранспорта.Код КАК ВидТранспортаКод,
		|	ОтчетНалогНаИмуществоТранспорт.ОтЛет,
		|	ОтчетНалогНаИмуществоТранспорт.ДоЛет
		|ИЗ
		|	Документ.ОтчетПоНалогуНаИмущество.Транспорт КАК ОтчетНалогНаИмуществоТранспорт
		|ГДЕ
		|	ОтчетНалогНаИмуществоТранспорт.Ссылка.Ссылка В(&МассивОбъектов)
		|ИТОГИ
		|	МАКСИМУМ(Дата),
		|	МАКСИМУМ(ОрганизацияНаименованиеПолное),
		|	МАКСИМУМ(ОрганизацияИНН),
		|	МАКСИМУМ(ОрганизацияГНСКод),
		|	МАКСИМУМ(ОрганизацияГНСНаименование),
		|	МАКСИМУМ(ОрганизацияКодПоОКПО)
		|ПО
		|	Ссылка";
	
	Запрос.УстановитьПараметр("МассивОбъектов", МассивОбъектов);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Шапка = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	ПервыйДокумент = Истина;
	
	Макет = Документы.ОтчетПоНалогуНаИмущество.ПолучитьМакет("ПФ_MXL_Группа4");
	
	Пока Шапка.Следующий() Цикл		
		Если НЕ ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		ВывестиЗаголовок(ТабличныйДокумент, Макет, Шапка);
		
		ВыборкаДетальныеЗаписи = Шапка.Выбрать();
		
		Номер1 = 202;
		Номер2 = 203;
		Номер3 = 204;
		Номер4 = 205;
		Номер5 = 206;
		Номер6 = 207;
		Номер7 = 208;
		Номер8 = 209;
		
		Счетчик = 0;
		СуммаНалогаА = 0;
		КоличествоСтрок = 1;
		КолСтрок = 0;
		ОбластьГруппаА      = Макет.ПолучитьОбласть("ГруппаА");

		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.АБВ = "А" Тогда
				//Номера табличной части
				ОбластьГруппаА.Параметры.Номер1  = Номер1 + Счетчик;
				ОбластьГруппаА.Параметры.Номер2  = Номер2 + Счетчик;
				ОбластьГруппаА.Параметры.Номер3  = Номер3 + Счетчик;
				ОбластьГруппаА.Параметры.Номер4  = Номер4 + Счетчик;
				ОбластьГруппаА.Параметры.Номер5  = Номер5 + Счетчик;
				ОбластьГруппаА.Параметры.Номер6  = Номер6 + Счетчик;
				ОбластьГруппаА.Параметры.Номер7  = Номер7 + Счетчик;
				ОбластьГруппаА.Параметры.Номер8  = Номер8 + Счетчик;
				Счетчик = Счетчик + 8;
				
				//Срок Эксплуатации
				Если ВыборкаДетальныеЗаписи.ДоЛет > 100 Тогда 
					ВыборкаДетальныеЗаписи.ДоЛет = 0;
				КонецЕсли;
				
				Если ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОтЛет) и ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДоЛет) Тогда
					Срок ="С " + Строка(ВыборкаДетальныеЗаписи.ОтЛет)+"    До "+ Строка(ВыборкаДетальныеЗаписи.ДоЛет)+ " лет";
				ИначеЕсли ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОтЛет) и Не ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДоЛет) Тогда
					Срок = "Свыше:  " + Строка(ВыборкаДетальныеЗаписи.ОтЛет)+ " лет";
				ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОтЛет) и ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДоЛет) Тогда
					Срок = " До "+ Строка(ВыборкаДетальныеЗаписи.ДоЛет)+ " лет";
				ИначеЕсли НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ОтЛет) и НЕ ЗначениеЗаполнено(ВыборкаДетальныеЗаписи.ДоЛет) Тогда
					Срок =""
				КонецЕсли;	
				
				ОбластьГруппаА.Параметры.КодВидаТранспорта   = ВыборкаДетальныеЗаписи.ВидТранспортаКод;
				ОбластьГруппаА.Параметры.МаркаТранспортногоСредства = ВыборкаДетальныеЗаписи.ОсновноеСредство;   
				ОбластьГруппаА.Параметры.ГодВыпуска		     = Формат(ВыборкаДетальныеЗаписи.ОсновноеСредство.ДатаВыпуска, "ДФ= yyyy"); 
				ОбластьГруппаА.Параметры.ОбъемДвигателя      = ВыборкаДетальныеЗаписи.ОбъемДвигателя;
				ОбластьГруппаА.Параметры.СтавкаНалога        = ВыборкаДетальныеЗаписи.Ставка;
				ОбластьГруппаА.Параметры.СуммаНалога         = ВыборкаДетальныеЗаписи.СуммаНалога;
				ОбластьГруппаА.Параметры.СуммаЛьготы         = "0";     
				ОбластьГруппаА.Параметры.СуммаНалогаКУплате  = ВыборкаДетальныеЗаписи.СуммаНалога;
				Если КоличествоСтрок = 15 Тогда 
					ОбластьГруппаА.Параметры.А                   = "А";
				Иначе
					ОбластьГруппаА.Параметры.А                   = "";
				КонецЕсли;
				СуммаНалогаА = СуммаНалогаА + ВыборкаДетальныеЗаписи.СуммаНалога; 
				КоличествоСтрок = КоличествоСтрок + 1;
				ТабличныйДокумент.Вывести(ОбластьГруппаА);			
				
			    КолСтрок = КолСтрок + 1;
			КонецЕсли;		
					
		КонецЦикла;

		Если КолСтрок < 25 Тогда
			Номер1 = 202 + 8 * КолСтрок;
			Номер2 = 203 + 8 * КолСтрок;
			Номер3 = 204 + 8 * КолСтрок;
			Номер4 = 205 + 8 * КолСтрок;
			Номер5 = 206 + 8 * КолСтрок;;
			Номер6 = 207 + 8 * КолСтрок;;
			Номер7 = 208 + 8 * КолСтрок;;
			Номер8 = 209 + 8 * КолСтрок;;
			Счетчик = 0;
			Пока КолСтрок < 25 Цикл
				ОбластьГруппаА.Параметры.Номер1  = Номер1 + Счетчик;
				ОбластьГруппаА.Параметры.Номер2  = Номер2 + Счетчик;
				ОбластьГруппаА.Параметры.Номер3  = Номер3 + Счетчик;
				ОбластьГруппаА.Параметры.Номер4  = Номер4 + Счетчик;
				ОбластьГруппаА.Параметры.Номер5  = Номер5 + Счетчик;
				ОбластьГруппаА.Параметры.Номер6  = Номер6 + Счетчик;
				ОбластьГруппаА.Параметры.Номер7  = Номер7 + Счетчик;
				ОбластьГруппаА.Параметры.Номер8  = Номер8 + Счетчик;
				ОбластьГруппаА.Параметры.КодВидаТранспорта   = "";
				ОбластьГруппаА.Параметры.МаркаТранспортногоСредства    = ""; 
				ОбластьГруппаА.Параметры.ГодВыпуска		     = ""; 
				ОбластьГруппаА.Параметры.ОбъемДвигателя      = "";
				ОбластьГруппаА.Параметры.СтавкаНалога        = "";
				ОбластьГруппаА.Параметры.СуммаНалога         = "";
				ОбластьГруппаА.Параметры.СуммаЛьготы 		 = "";
				ОбластьГруппаА.Параметры.СуммаНалогаКУплате  = "";
				Если КолСтрок + КоличествоСтрок - 1  = 15 Тогда 
					ОбластьГруппаА.Параметры.А                   = "А";
				Иначе
					ОбластьГруппаА.Параметры.А                   = "";
				КонецЕсли;
				
				Счетчик = Счетчик + 8;
				КолСтрок = КолСтрок + 1;
				ТабличныйДокумент.Вывести(ОбластьГруппаА);
			КонецЦикла;    
		КонецЕсли;
	
		//Вывод границы между областью А и Б
		ОбластьГраницаБ = Макет.ПолучитьОбласть("ГраницаБ");
		ТабличныйДокумент.Вывести(ОбластьГраницаБ);
		
		ВыборкаДетальныеЗаписи.Сбросить();
		//Вывод Группы Б
		Номер1 = 402;
		Номер2 = 403;
		Номер4 = 404;
		Номер5 = 405;
		Номер6 = 406;
		Номер7 = 407;
		Номер8 = 408;
		
		СчетчикБ = 0;
		СуммаНалогаБ = 0;
		КолСтрокБ = 1;
		КолСтрок = 0;
		ОбластьГруппаБ      = Макет.ПолучитьОбласть("ГруппаБ");
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.АБВ = "Б" Тогда
				//Номера табличной части
				ОбластьГруппаБ.Параметры.Номер1  = Номер1 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер2  = Номер2 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер4  = Номер4 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер5  = Номер5 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер6  = Номер6 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер7  = Номер7 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер8  = Номер8 + СчетчикБ;
				СчетчикБ = СчетчикБ + 7;
				//Сумма налога по группе Б
				СаммаНалога = Окр(ВыборкаДетальныеЗаписи.ОбъемДвигателя * 0.005);
				//
				ОбластьГруппаБ.Параметры.КодВидаТранспорта   = ВыборкаДетальныеЗаписи.ВидТранспортаКод; 
				ОбластьГруппаБ.Параметры.МаркаТранспортногоСредства = ВыборкаДетальныеЗаписи.ОсновноеСредство; 
				ОбластьГруппаБ.Параметры.ОбъемДвигателя      = ВыборкаДетальныеЗаписи.ОбъемДвигателя;
				ОбластьГруппаБ.Параметры.СтавкаНалога        = "0,5%";
				ОбластьГруппаБ.Параметры.СуммаНалога         = СаммаНалога;
				ОбластьГруппаБ.Параметры.СуммаНалогаКУплате  = СаммаНалога;
				Если КолСтрокБ - 1 = 1 Тогда 
					ОбластьГруппаБ.Параметры.Б               = "Б";
				Иначе
					ОбластьГруппаБ.Параметры.Б               = "";
				КонецЕсли;
				СуммаНалогаБ = СуммаНалогаБ + СаммаНалога; 
				КоличествоСтрок = КоличествоСтрок + 1;
				ТабличныйДокумент.Вывести(ОбластьГруппаБ);
				КолСтрок = КолСтрок + 1;
			КонецЕсли;
		КонецЦикла;    

		Если КолСтрок < 2 Тогда
			Номер1 = 402 + 7 * КолСтрок;
			Номер2 = 403 + 7 * КолСтрок;
			Номер4 = 404 + 7 * КолСтрок;
			Номер5 = 405 + 7 * КолСтрок;
			Номер6 = 406 + 7 * КолСтрок;
			Номер7 = 407 + 7 * КолСтрок;
			Номер8 = 408 + 7 * КолСтрок;
			
			СчетчикБ = 0;
			Пока КолСтрок < 2 Цикл
				ОбластьГруппаБ.Параметры.Номер1              = Номер1 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер2              = Номер2 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер4              = Номер4 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер5              = Номер5 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер6              = Номер6 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер7              = Номер7 + СчетчикБ;
				ОбластьГруппаБ.Параметры.Номер8              = Номер8 + СчетчикБ;
				
				ОбластьГруппаБ.Параметры.КодВидаТранспорта   = "";
				ОбластьГруппаБ.Параметры.МаркаТранспортногоСредства = ""; 
				ОбластьГруппаБ.Параметры.ОбъемДвигателя      = "";
				ОбластьГруппаБ.Параметры.СтавкаНалога        = "";
				ОбластьГруппаБ.Параметры.СуммаНалога         = "";
				ОбластьГруппаБ.Параметры.СуммаНалогаКУплате	 = "";
				Если КолСтрок + КолСтрокБ - 1  = 1 Тогда 
					ОбластьГруппаБ.Параметры.Б                   = "Б";
				Иначе
					ОбластьГруппаБ.Параметры.Б                   = "";
				КонецЕсли;
				
				СчетчикБ = СчетчикБ + 7;
				КолСтрок = КолСтрок + 1;
				ТабличныйДокумент.Вывести(ОбластьГруппаБ);
			КонецЦикла;    
		КонецЕсли;        
		
		//Вывод границы между областью Б и В
		ОбластьГраницаВ = Макет.ПолучитьОбласть("ГраницаВ");
		ТабличныйДокумент.Вывести(ОбластьГраницаВ);
		
		ВыборкаДетальныеЗаписи.Сбросить();
		//Вывод Группы В
		Номер1 = 416;
		Номер2 = 417;
		Номер4 = 418;
		Номер5 = 419;
		Номер6 = 420;
		Номер7 = 421;
		Номер8 = 422;
		СчетчикВ = 0;
		СуммаНалогаВ = 0;
		КолСтрокВ = 1;
		КолСтрок = 0;
		
		ОбластьГруппаВ      = Макет.ПолучитьОбласть("ГруппаВ");
	
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Если ВыборкаДетальныеЗаписи.АБВ = "В" Тогда
				//Номера табличной части
				ОбластьГруппаВ.Параметры.Номер1  = Номер1 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер2  = Номер2 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер4  = Номер4 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер5  = Номер5 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер6  = Номер6 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер7  = Номер7 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер8  = Номер8 + СчетчикВ;
				СчетчикВ = СчетчикВ + 7;
				////Сумма налога по группе В
				
				// ХБ >> Выводим в отчет налоговую базу для по группе "В"
				Если ВыборкаДетальныеЗаписи.Ставка <> 0 Тогда
					НалоговаяБаза = ВыборкаДетальныеЗаписи.СуммаНалога / ВыборкаДетальныеЗаписи.Ставка * 100;
				Иначе
					НалоговаяБаза = 0;
				КонецЕсли;
				
				ОбластьГруппаВ.Параметры.КодВидаТранспорта   = ВыборкаДетальныеЗаписи.ВидТранспортаКод;
				ОбластьГруппаВ.Параметры.МаркаТранспортногоСредства = ВыборкаДетальныеЗаписи.ОсновноеСредство; 
				ОбластьГруппаВ.Параметры.ОбъемДвигателя      = НалоговаяБаза;
				ОбластьГруппаВ.Параметры.СтавкаНалога        = "" + ВыборкаДетальныеЗаписи.Ставка + "%";
				ОбластьГруппаВ.Параметры.СуммаНалога         = ВыборкаДетальныеЗаписи.СуммаНалога;
				ОбластьГруппаВ.Параметры.СуммаНалогаКУплате  = ВыборкаДетальныеЗаписи.СуммаНалога;
				Если КолСтрокВ - 1 = 1 Тогда 
					ОбластьГруппаВ.Параметры.В               = "В";
				Иначе
					ОбластьГруппаВ.Параметры.В               = "";
				КонецЕсли;
				СуммаНалогаВ = СуммаНалогаВ + ВыборкаДетальныеЗаписи.СуммаНалога; 
				КоличествоСтрок = КоличествоСтрок + 1;
				ТабличныйДокумент.Вывести(ОбластьГруппаВ);
				КолСтрок = КолСтрок + 1;
			КонецЕсли;
		КонецЦикла;    
		
		Если КолСтрок < 2 Тогда
			Номер1 = 416 + 7 * КолСтрок;
			Номер2 = 417 + 7 * КолСтрок;
			Номер4 = 418 + 7 * КолСтрок;
			Номер5 = 419 + 7 * КолСтрок;
			Номер6 = 420 + 7 * КолСтрок;
			Номер7 = 421 + 7 * КолСтрок;
			Номер8 = 422 + 7 * КолСтрок;
	
			СчетчикВ = 0;
			Пока КолСтрок < 2 Цикл
				ОбластьГруппаВ.Параметры.Номер1              = Номер1 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер2              = Номер2 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер4              = Номер4 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер5              = Номер5 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер6              = Номер6 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер7              = Номер7 + СчетчикВ;
				ОбластьГруппаВ.Параметры.Номер8              = Номер8 + СчетчикВ;
				
				ОбластьГруппаВ.Параметры.КодВидаТранспорта   = "";
				ОбластьГруппаВ.Параметры.МаркаТранспортногоСредства = ""; 
				ОбластьГруппаВ.Параметры.ОбъемДвигателя      = "";
				ОбластьГруппаВ.Параметры.СтавкаНалога        = "";
				ОбластьГруппаВ.Параметры.СуммаНалога         = "";
				ОбластьГруппаВ.Параметры.СуммаНалогаКУплате  = "";
				Если КолСтрок + КолСтрокВ - 1  = 1 Тогда 
					ОбластьГруппаВ.Параметры.В                   = "В";
				Иначе
					ОбластьГруппаВ.Параметры.В                   = "";
				КонецЕсли;
				
				СчетчикВ = СчетчикВ + 7;
				КолСтрок = КолСтрок + 1;
				ТабличныйДокумент.Вывести(ОбластьГруппаВ);
			КонецЦикла;    
		КонецЕсли; 
		
		//Вывод области Итог
		ОбластьИтог         = Макет.ПолучитьОбласть("Итог");
		ОбластьИтог.Параметры.СуммаНалогаКУплате  = СуммаНалогаА + СуммаНалогаБ + СуммаНалогаВ;
		ТабличныйДокумент.Вывести(ОбластьИтог);
		//Вывод Области Подвала
		ОбластьПодвал       = Макет.ПолучитьОбласть("Подвал");
		ТабличныйДокумент.Вывести(ОбластьПодвал);
				
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, 
		                                               НомерСтрокиНачало, ОбъектыПечати, Шапка.Ссылка);
			
	КонецЦикла;
	
	Возврат ТабличныйДокумент;
	
КонецФункции

// Формирует печатные формы.
//
// Параметры:
//  МассивОбъектов  - Массив    - ссылки на объекты, которые нужно распечатать;
//  ПараметрыПечати - Структура - дополнительные настройки печати;
//  КоллекцияПечатныхФорм - ТаблицаЗначений - сформированные табличные документы (выходной параметр)
//  ОбъектыПечати         - СписокЗначений  - значение - ссылка на объект;
//                                            представление - имя области в которой был выведен объект (выходной параметр);
//  ПараметрыВывода       - Структура       - дополнительные параметры сформированных табличных документов (выходной параметр).
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Группа2") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Группа2", 
		"Налог на имущество. 2 группа", 
		ОтчетПоНалогуНаИмущество2Группы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_Группа2");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Группа3") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Группа3", 
		"Налог на имущество. 3 группа", 
		ОтчетПоНалогуНаИмущество3Группы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_Группа3");
	КонецЕсли;
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "Группа4") Тогда
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, 
		"Группа4", 
		"Налог на имущество. 4 группа", 
		ОтчетПоНалогуНаИмущество4Группы(МассивОбъектов, ОбъектыПечати),
		,
		"Документ.СписаниеСпецодеждыДосрочное.ПФ_MXL_Группа4");
	КонецЕсли;
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Группа2";
	КомандаПечати.Представление = НСтр("ru = 'Налог на имущество. 2 группа'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Порядок = 2;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Группа3";
	КомандаПечати.Представление = НСтр("ru = 'Налог на имущество. 3 группа'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Порядок = 3;
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Группа4";
	КомандаПечати.Представление = НСтр("ru = 'Налог на имущество. 4 группа'");
	КомандаПечати.СписокФорм = "ФормаДокумента,ФормаСписка";
	КомандаПечати.Порядок = 4;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
